Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
efficientnet-b7 (Model)      (None, 7, 7, 2560)        64097680  
_________________________________________________________________
dense_8 (Dense)              (None, 7, 7, 1024)        2622464   
_________________________________________________________________
flatten_4 (Flatten)          (None, 50176)             0         
_________________________________________________________________
dense_9 (Dense)              (None, 1)                 50177     
=================================================================
Total params: 66,770,321
Trainable params: 20,448,481
Non-trainable params: 46,321,840
_________________________________________________________________
